{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6-tf", "config": {"name": "sequential", "layers": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 28, 28], "data_format": "channels_last", "name": "input", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "bias_constraint": null, "units": 256, "use_bias": true, "name": "dense_1", "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu_1", "activation": "relu", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "dtype": "float32", "name": "dropout_1", "rate": 0.2}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "bias_constraint": null, "units": 256, "use_bias": true, "name": "dense_2", "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "relu_2", "activation": "relu", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "noise_shape": null, "dtype": "float32", "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_constraint": null, "bias_constraint": null, "units": 10, "use_bias": true, "name": "dense_3", "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "softmax", "activation": "softmax", "dtype": "float32"}}]}}