{"config": {"name": "sequential", "layers": [{"config": {"name": "input", "batch_input_shape": [null, 28, 28], "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "use_bias": true, "units": 256, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "relu_1", "dtype": "float32", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "dtype": "float32", "noise_shape": null, "trainable": true, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "use_bias": true, "units": 256, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "relu_2", "dtype": "float32", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "dtype": "float32", "noise_shape": null, "trainable": true, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "use_bias": true, "units": 10, "kernel_regularizer": null, "name": "dense_3", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "softmax", "dtype": "float32", "activation": "softmax", "trainable": true}, "class_name": "Activation"}]}, "backend": "tensorflow", "keras_version": "2.1.6-tf", "class_name": "Sequential"}